# 응용 SW 기초 기술 활용

## 운영체제
### 운영체제의 목적
- 처리 능력 향상
- 반환 시간 단축
- 사용 가능도 향상
- 신뢰도 향상

### 운영체제의 주요 자원 관리
- 프로세스 관리
- 기억장치 관리
- 주변장치 관리
- 파일 관리

### 운영체제의 종류
- Windows
- UNIX
- LINUX
- MacOS
- MS-DOS


## Windows
- 마이크로소프트사가 개발한 운렬체제
- 그래픽 사용자 인터페이스(GUI)
- 선점형 멀티테스킹(Preemptive Multi-Tasking)
- PnP(Plug and Play, 자동 감지 기능)
- OLE(Object Linking and Embedding)
- 255자의 긴 파일명
- Single-User 시스템

## UNIX / LINUX / MacOS
### UNIX 특징
- 개방형 시스템
- 크기가 작고 이해하기 쉬움
- 다중 사용자, 다중 작업 지원
- 트리 구조의 파일 시스템을 갖는다

### UNIX 시스템의 구성
- 커널 : 프로세스 관리, 기억장치 관리, 파일 관리, 입출력 관리, 프로세스간 통신, 데이터 전송 및 변환
- 쉘 : 시스템과 사용자간의 인터페이스를 담당
- 유틸리티 프로그램 : 일반 사용자가 작성한 응용 프로그램을 처리하는데 사용


## 기억장치 관리의 개요
### 반입(Fetch) 전략
: 보조기억장치에 보관중인 프로그램이나 데이터를 언제 주기억장치로 적재할 것인지를 결정
- 요구반입(Demand Fetch)
- 예상반입(Anticipatory Fetch)

### 배치(Placement) 전략
: 새로 반입되는 프로그램이나 데이터를 주기억장치의 어디에 위치시킬 것인지를 결정하는 전략
- 최초 적합(Firtst Fit)
- 최적 적합(Best Fit)
- 최악 적합(Worst Fit)

### 교체(Replacement) 전략
: 주기억장치의 모든 영역이 이미 사용중인 상태에서 새로운 프로그램이나 데이터를 주기억장치에 배치하려고 할 때,
이미 사용되고 있는 영역 중에서 어느 영역을 교체하여 사용할 것인지를 결정하는 전략
